* 1
| STATS                                         |
|-----------------------------------------------|
| 516/619 Solved - Easy 153 Medium 262 Hard 101 |
| 103 Locked                                    |
Something strange, add 685. Redundant Connection II.py, but got "506/609 Solved - Easy 148 Medium 260 Hard 98" to "506/609 Solved - Easy 148 Medium 259 Hard 99"

I found leetcode will lock some questions several days after release\\
The digit commit message means the times I try to figure it out\\

* 2
| UNSOLVED                                     |        | reason  |
|----------------------------------------------+--------+---------|

* 3
| DRAFT                                     |        |          |
|-------------------------------------------+--------+----------|
| 433 Minimum Genetic Mutation              | Medium | SOLVED   |
| 457 Circular Array Loop                   | Medium | SOLVED   |
| 458 Poor Pigs                             | Easy   | SOLVED   |
| 518 Coin Change 2                         | Medium | SOLVED   |
|-------------------------------------------+--------+----------|
| 578 Get Highest Answer Rate Question      | Medium | LOCKED   |
| 579 Find Cumulative Salary of an Employee | Hard   | LOCKED   |
|-------------------------------------------+--------+----------|
| 626 Exchange Seats                        | Medium | DATABASE |

* 4
| NOTE                                           |
|------------------------------------------------|
| 32 the method use stack is better              |
| 41 the bucket sort like method is better       |
| 365 Water and Jug Problem.py, only beats 2.63% |
| 460 is not O(1), only beats 1.77%              |
|------------------------------------------------|
|                                                |
|------------------------------------------------|
| Single Number                                  |
| Maximum XOR of Two Numbers in an Array         |
|------------------------------------------------|
|                                                |
|------------------------------------------------|
| same strategy 327, 363, 523, 525               |
| construct one by one dp 312, 546               |

* 5
|  LOCKED | 103 |
|---------+-----|
| 156-159 |   4 |
|     161 |   1 |
|     163 |   1 |
|     170 |   1 |
|     186 |   1 |
| 243-256 |  14 |
|     259 |   1 |
|     261 |   1 |
| 265-267 |   3 |
| 269-272 |   4 |
| 276-277 |   2 |
| 280-281 |   2 |
| 285-286 |   2 |
|     288 |   1 |
|     291 |   1 |
| 293-294 |   2 |
|     296 |   1 |
|     298 |   1 |
|     302 |   1 |
|     305 |   1 |
|     308 |   1 |
|     311 |   1 |
|     314 |   1 |
|     317 |   1 |
|     320 |   1 |
|     323 |   1 |
|     325 |   1 |
|     333 |   1 |
| 339-340 |   2 |
|     346 |   1 |
|     348 |   1 |
|     351 |   1 |
|     353 |   1 |
|     356 |   1 |
| 358-362 |   5 |
|     364 |   1 |
|     366 |   1 |
| 369-370 |   2 |
|     379 |   1 |
|     408 |   1 |
|     411 |   1 |
|     418 |   1 |
|     422 |   1 |
|     425 |   1 |
|     439 |   1 |
|     444 |   1 |
|     465 |   1 |
|     469 |   1 |
|     471 |   1 |
|     484 |   1 |
|     487 |   1 |
|     490 |   1 |
|     499 |   1 |
|     505 |   1 |
|     527 |   1 |
|     531 |   1 |
|     533 |   1 |
|     536 |   1 |
| 544-545 |   2 |
| 548-549 |   2 |
|     555 |   1 |
|     562 |   1 |
|     568 |   1 |
|     573 |   1 |
|     582 |   1 |
|     588 |   1 |
|     604 |   1 |
|     616 |   1 |
|     642 |   1 |
|     656 |   1 |
#+TBLFM: @1$2=vsum(@2$2..@>$2)
